# โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า 
# "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  
# แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า 
# "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" 
# โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์
print('=======================')
print('โปรแกรมตรวจสอบน้ำหนักรถบรรทุก')
print('=======================')
ทะเบียนรถ = input('ทะเบียนรถ : ')
น้ำหนักรถบรรทุก = float (input('น้ำหนักรถบรรทุก : '))
print('=======================')
if น้ำหนักรถบรรทุก > 1000 : # อย่าลืมใส่ Colon
    print(f'รถทะเบียน {ทะเบียนรถ} ของคุณ ไมผ่านเกณฑ์')
    print(f'น้ำหนักรถไม่ผ่านเกณฑ์...')
else : 
    print(f'รถทะเบียน {ทะเบียนรถ} ของคุณ ผ่านเกณฑ์')
    print(f'น้ำหนักรถผ่านเกณฑ์')
