# โปรแกรมตรวจสอบรถว่าผ่านเกณฑ์ของการตรวจสอบค่าคาร์บอนไดซ์ออกไซน์หรือ 
# โดยหากค่าคาร์บอนไดซ์ออกไซน์มีค่าเกินกว่า 678.55 ให้แสดงข้อความว่า “ไม่ผ่าน”  หากน้อยกว่า 678.55 ให้แสดงข้อความ “ผ่าน” 
# โดยให้รับชื่อเจ้าของ ทะเบียนรถ และปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ที่วัดได้ ทางแป้นพิมพี่
print('=======================')
print('Program Carbon car Checker')
print('=======================')

user = input('ชื่อเจ้าของรถ : ')
car_number = input('ป้อนทะเบียนรถ : ')
car_carbon = float(input('ป้อนปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ : '))
print('=======================')
if car_carbon > 678.55 : # อย่าลืมใส่ Colon
    print(f'รถทะเบียน {car_number} ของคุณ {user} ไมผ่านเกณฑ์')
    print(f'เสียใจด้วยนะ ไปซ่อม...')
else : 
    print(f'รถทะเบียน {car_number} ของคุณ {user} ผ่านเกณฑ์')
    print(f'สุดยอด')
print('=======================')
print('ขอบคุณที่ใช้บริการ')
print('=======================')
