# โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุมีค่าตั้งแต่ 55 พ.ศ ปีขึ้นไป 
# ให้แสดงข้อความว่า "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ
from datetime import datetime

print('=======================')
print('โปรแกรมซึ่งรับชื่อ')
print('=======================')
ชื่อ = input('ป้อนชื่อ : ')
ปีเกิด = int(input('ป้อนปีเกิด (พศ) : '))
print('=======================')
อายุของคุณ = (datetime.now().year + 543) - ปีเกิด
if อายุของคุณ >= 55 :
    print('คุณ {} อายุ {} ปี แก่แล้วนะ'.format(ชื่อ, อายุของคุณ))
    print('เข้าใจนะ')
else :
     print('คุณ {} อายุ {} ปี ยังไม่แก่เลยย'.format(ชื่อ, อายุของคุณ))
     print('ไม่ตายไวละว่ะ')
