# คำสั่งแสดงผลข้อมูลใดๆ หลายประเภทใน print() เดียว เขียนได้ 4 วิธี
# วิธีที่ 1 ใช้เครื่องหมาย , (comma) คั่นระหว่างข้อมูล (ตรงที่ , เวลาแสดงผลจะเว้น 1 space)
print('DTI',999,'Bangna',10+20,True,'Hi',158.45) 

# วิธีที่ 2 ใช้เครื่องหมาย + (plus) (ข้อมูลตรงไหนไม่ใช่ string ต้องทำให้เป็น string ก่อนด้วยฟังก์ชัน str()) คั่นระหว่างข้อมูล (ตรงที่ + เวลาแสดงผลจะไม่มี space)
print('DTI' + str(999) + 'Bangna' + str(10+20) + str(True) + 'Hi' + str(158.45))
print('DTI' + str(999) + 'Bangna' + str(10+20) + ' ' + str(True) + 'Hi' + str(158.45))

# วิธีที่ 3 ใช้เมธอด format() ข้อมูลที่จะแสดงผลต้องเป็น string 
# (ข้อมูลไหนที่ไม่ใช่ string ให้เขียนในวงเล็บของ format และตรงจุดที่ต้องการแสดงผลให้ใส่ {} แทน)
print('DTI {} Bangna {} {} Hi {}'.format(999,10+20,True, 158.45))

# index number        0    1    2    3       
print('{3} {0}'.format('aa','bb','cc','dd'))

# วิธีที่ 4 ใช้ f-string ข้อมูลที่จะแสดงผลต้องเป็น string โดยต้องมี f นำหน้า 
# (ข้อมูลไหนที่ไม่ใช่ string ให้เขียนใน {} ณ ตำแหน่งที่จะแสดงขึ้นได้เลย)
print(f'DTI {999} Bangna {10+20} {True} Hi {158.45}')

