# โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
# ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
# ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด     1% จากยอดขาย
# ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด     3% จากยอดขาย
# ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด     5% จากยอดขาย
print ('===========================================')
print ('โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย')
print ('===========================================')
รหัสพนักงาน = input ('รหัสพนักงาน : ')
ชื่อพนักงาน = input ('ชื่อพนักงาน : ')
ยอดขายของพนักงาน = float (input ('ยอดขายของพนักงาน: '))
print ('===========================================')
if ยอดขายของพนักงาน <= 1000 :
   ค่าคอมมิชชั่น =  0.0
elif ยอดขายของพนักงาน <= 2000 :
    ค่าคอมมิชชั่น =  ยอดขายของพนักงาน *0.1
elif ยอดขายของพนักงาน <= 3000 :
    ค่าคอมมิชชั่น =  ยอดขายของพนักงาน *0.3
else :
    ค่าคอมมิชชั่น =  ยอดขายของพนักงาน *0.5
print ('===========================================')
print(' รหัสพนักงาน :', รหัสพนักงาน)
print(' ชื่อพนักงาน :', ชื่อพนักงาน)
print(' ยอดขายพนักงาน :', ยอดขายของพนักงาน )
print(' ค่าคอมมิชชั่น :', ค่าคอมมิชชั่น)
print('=====================================')
