# โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
#    หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
#    หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
#    หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
#    หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
#    หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
#    หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

def check_bus_route(route):
    if route == "57":
        return "สาย 57 ไปปิ่นเกล้า บางขุนนนท์"
    elif route == "3":
        return "สาย 3 ไปสนามหลวง ลาดพร้าว"
    elif route == "71":
        return "สาย 71 ไปหัวลำโพง เยาวราช"
    elif route == "56":
        return "สาย 56 ไปบางลำพู สะพานกรุงธน"
    elif route == "539":
        return "สาย 539 ไปอนุสวรีย์ชัย สามเสน"
    else:
        return "ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม"
 
def main():
    print('-------------------------------')
    print(' Program check Bus Route')
    print('-------------------------------')


def show_menu():
    print('-------------------------------')
    bus_route = input('ป้อนสายรถเมล์ที่ต้องการตรวจสอบ ==>> ')
    result = check_bus_route(bus_route)

    print('-------------------------------')
    print(result)
    print('-------------------------------')

main()
show_menu()
