# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

def ชื่อโปรแกรม():
    print('----------------------------------------')
    print(' โปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวน')
    print('----------------------------------------')


def รับเลข(เลข):
    return int(input(f"ป้อนตัวเลขที่ {เลข} : "))


def ผลคูณ(a, b):
    return a * b


def แสดงผล(a, b, ผลลัพ):
    print(f"ผลคูณของ {a} x {b} = {ผลลัพ}")


def main():
    ชื่อโปรแกรม()
    while True:
        num1 = รับเลข(1)
        num2 = รับเลข(2)
        result = ผลคูณ(num1, num2)
        แสดงผล(num1, num2, result)
        if result > 5000:
            print("ผลคูณมากกว่า 5000 โปรแกรมจะหยุดทำงาน")
            break
main()
